RaceHanyang/STM32F334R8_BatteryLVControl/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f3xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define PrechargeStateSignal1_Pin GPIO_PIN_13
#define PrechargeStateSignal1_GPIO_Port GPIOC
#define PrechargeStateSignal2_Pin GPIO_PIN_14
#define PrechargeStateSignal2_GPIO_Port GPIOC
#define RelayContactSignal1_Pin GPIO_PIN_0
#define RelayContactSignal1_GPIO_Port GPIOB
#define RelayContactSignal2_Pin GPIO_PIN_1
#define RelayContactSignal2_GPIO_Port GPIOB
#define RelayContactSignal3_Pin GPIO_PIN_2
#define RelayContactSignal3_GPIO_Port GPIOB
#define TSALSignal_Pin GPIO_PIN_10
#define TSALSignal_GPIO_Port GPIOB
#define IMDStatusSignal_Pin GPIO_PIN_11
#define IMDStatusSignal_GPIO_Port GPIOB
#define Fan_Tach_S1_Pin GPIO_PIN_15
#define Fan_Tach_S1_GPIO_Port GPIOB
#define Fan_Tach_S0_Pin GPIO_PIN_6
#define Fan_Tach_S0_GPIO_Port GPIOC
#define Fan_On_Pin GPIO_PIN_7
#define Fan_On_GPIO_Port GPIOC
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
